# Joining_Data_in_SQL

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
from jupyterthemes import jtplot

jtplot.style()
warnings.filterwarnings('ignore')
%config InlineBackend.figure_format='retina'

## 1. Introduction to joins

### prime_ministers table

```
+-----------+---------------+-------------------------+
| country   | continent     | prime_minister          |
|-----------+---------------+-------------------------|
| Egypt     | Africa        | Sherif Ismail           |
| Portugal  | Europe        | Antonio Costa           |
| Vietnam   | Asia          | Nguyen Xuan Phuc        |
| Haiti     | North America | Jack Guy Lafontant      |
| India     | Asia          | Narendra Modi           |
| Australia | Oceania       | Malcolm Turnbull        |
| Norway    | Europe        | Erna Solberg            |
| Brunei    | Asia          | Hassanal Bolkiah        |
| Oman      | Asia          | Qaboos bin Said al Said |
| Spain     | Europe        | Mariano Rajoy           |
+-----------+---------------+-------------------------+
```

### presidents table

```SQL
SELECT *
  FROM presidents;
```

```
+-----------+---------------+-------------------------+
| country   | continent     | president               |
|-----------+---------------+-------------------------|
| Egypt     | Africa        | Abdel Fattah el-Sisi    |
| Portugal  | Europe        | Marcelo Rebelo de Sousa |
| Haiti     | North America | Jovenel Moise           |
| Uruguay   | South America | Jose Mujica             |
| Liberia   | Africa        | Ellen Johnson Sirleaf   |
| Chile     | South America | Michelle Bachelet       |
| Vietnam   | Asia          | Tran Dai Quang          |
+-----------+---------------+-------------------------+
```

### INNER JOIN in SQL

```SQL
SELECT p1.country, p1.continent,
       prime_minister, president
  FROM prime_ministers AS p1
    INNER JOIN presidents AS p2
      ON p1.country = p2.country;
```

```
+-----------+---------------+--------------------+-------------------------+
| country   | continent     | prime_minister     | president               |
|-----------+---------------+--------------------+-------------------------|
| Egypt     | Africa        | Sherif Ismail      | Abdel Fattah el-Sisi    |
| Portugal  | Europe        | Antonio Costa      | Marcelo Rebelo de Sousa |
| Vietnam   | Asia          | Nguyen Xuan Phuc   | Tran Dai Quang          |
| Haiti     | North America | Jack Guy Lafontant | Jovenel Moise           |
+-----------+---------------+--------------------+-------------------------+
```

### №1 Inner join

```SQL
SELECT *
  FROM cities
```

```SQL
SELECT * 
  FROM cities
  INNER JOIN countries
    ON cities.country_code = countries.code;
```

```SQL
SELECT cities.name AS city,
       countries.name as country,
       countries.region
  FROM cities AS cities
  INNER JOIN countries AS countries
    ON cities.country_code = countries.code;
```

### №2 Inner join (2)

```SQL
SELECT c.code AS country_code, name, year, inflation_rate
  FROM countries AS c
  INNER JOIN economies AS e
    ON c.code = e.code;
```

### №3 Inner join (3)

```SQL
SELECT c.code, c.name, c.region,
       p.year, p.fertility_rate
  FROM countries AS c
  INNER JOIN populations AS p
    ON c.code = p.country_code
```

```SQL
SELECT c.code, name, region, e.year, fertility_rate, unemployment_rate
  FROM countries AS c
  INNER JOIN populations AS p
    ON c.code = p.country_code
  INNER JOIN economies AS e
    ON c.code = e.code;
```

```SQL
SELECT c.code, name, region, e.year,
       fertility_rate, unemployment_rate
  FROM countries AS c
  INNER JOIN populations AS p
    ON c.code = p.country_code
  INNER JOIN economies AS e
    ON c.code = e.code AND p.year = e.year;
```

## 2. INNER JOIN via USING

### The INNER JOIN diagram again

```SQL
SELECT left_table.id AS L_id
       left_table.val AS L_val
       right_table.val AS R_val
  FROM left_table
  INNER JOIN right_table
    ON left_table.id = right_tab
```

<img src='[17]Joining_Data_in_SQL/Pictures/The_INNER_JOIN_diagram_again.png' alt='The INNER JOIN diagram again' width=300 align='left'>

### The INNER JOIN diagram with USING

```SQL
SELECT left_table.id AS L_id
       left_table.val AS L_v
       right_table.val AS R_
  FROM left_table
  INNER JOIN right_table
    USING (id);
```

### Countries with prime ministers and presidents

```SQL
SELECT p1.country, p1.continent, prime_minister, president
  FROM ___ AS p1
  INNER JOIN ___ AS p2
    ___ (___);
```

*One answer:*

```SQL
SELECT p1.country, p1.continent, prime_minister, president
FROM presidents AS p1
INNER JOIN prime_ministers AS p2
USING (country);
```

```
+-----------+---------------+--------------------+-------------------------+
| country   | continent     | prime_minister     | president               |
|-----------+---------------+--------------------+-------------------------|
| Egypt     | Africa        | Sherif Ismail      | Abdel Fattah el-Sisi    |
| Portugal  | Europe        | Antonio Costa      | Marcelo Rebelo de Sousa |
| Vietnam   | Asia          | Nguyen Xuan Phuc   | Tran Dai Quang          |
| Haiti     | North America | Jack Guy Lafontant | Jovenel Moise           |
+-----------+---------------+--------------------+-------------------------+
```

### №4 Inner join with using

```SQL
SELECT c.name AS country,
       continent,
       l.name AS language,
       official
  FROM countries AS c
  INNER JOIN languages AS l
    USING(code)
```

## 3. Self-ish joins, justin CASE

### Join a table to itself?

```
+-----------+---------------+-------------------------+
| country   | continent     | prime_minister          |
|-----------+---------------+-------------------------|
| Egypt     | Africa        | Sherif Ismail           |
| Portugal  | Europe        | Antonio Costa           |
| Vietnam   | Asia          | Nguyen Xuan Phuc        |
| Haiti     | North America | Jack Guy Lafontant      |
| India     | Asia          | Narendra Modi           |
| Australia | Oceania       | Malcolm Turnbull        |
| Norway    | Europe        | Erna Solberg            |
| Brunei    | Asia          | Hassanal Bolkiah        |
| Oman      | Asia          | Qaboos bin Said al Said |
| Spain     | Europe        | Mariano Rajoy           |
+-----------+---------------+-------------------------+
```

### Join prime_ministers to itself?

```SQL
SELECT p1.country AS country1,
       p2.country AS country2,
       p1.continent
  FROM prime_ministers AS p1
  INNER JOIN prime_ministers AS p2
    ON p1.continent = p2.continent
LIMIT 14;
```

```
+------------+------------+---------------+
| country1   | country2   | continent     |
|------------+------------+---------------|
| Egypt      | Egypt      | Africa        |
| Portugal   | Spain      | Europe        |
| Portugal   | Norway     | Europe        |
| Portugal   | Portugal   | Europe        |
| Vietnam    | Oman       | Asia          |
| Vietnam    | Brunei     | Asia          |
| Vietnam    | India      | Asia          |
| Vietnam    | Vietnam    | Asia          |
| Haiti      | Haiti      | North America |
| India      | Oman       | Asia          |
| India      | Brunei     | Asia          |
| India      | India      | Asia          |
| India      | Vietnam    | Asia          |
| Australia  | Australia  | Oceania       |
+------------+------------+---------------+
```

### Finishing off the self-join on prime_ministers

```SQL
SELECT p1.country AS country1,
       p2.country AS country2,
       p1.continent
  FROM prime_ministers AS p1
  INNER JOIN prime_ministers AS p2
    ON p1.continent = p2.continent AND p1.country <> p2.country
LIMIT 13;
```

```
+------------+------------+-------------+
| country1   | country2   | continent   |
|------------+------------+-------------|
| Portugal   | Spain      | Europe      |
| Portugal   | Norway     | Europe      |
| Vietnam    | Oman       | Asia        |
| Vietnam    | Brunei     | Asia        |
| Vietnam    | India      | Asia        |
| India      | Oman       | Asia        |
| India      | Brunei     | Asia        |
| India      | Vietnam    | Asia        |
| Norway     | Spain      | Europe      |
| Norway     | Portugal   | Europe      |
| Brunei     | Oman       | Asia        |
| Brunei     | India      | Asia        |
| Brunei     | Vietnam    | Asia        |
+------------+------------+-------------+
```

### CASE WHEN and THEN

```
+-----------+---------------+--------------+
| name      | continent     | indep_year   |
|-----------+---------------+--------------|
| Australia | Oceania       | 1901         |
| Brunei    | Asia          | 1984         |
| Chile     | South America | 1810         |
| Egypt     | Africa        | 1922         |
| Haiti     | North America | 1804         |
| India     | Asia          | 1947         |
| Liberia   | Africa        | 1847         |
| Norway    | Europe        | 1905         |
| Oman      | Asia          | 1951         |
| Portugal  | Europe        | 1143         |
| Spain     | Europe        | 1492         |
| Uruguay   | South America | 1828         |
| Vietnam   | Asia          | 1945         |
+-----------+---------------+--------------+
```

### Preparing indep_year_group in states

```SQL
SELECT name, continent, indep_year,
    CASE WHEN ___ < ___ THEN 'before 1900'
         WHEN indep_year <= 1930 THEN '___'
         ELSE '___' END
         AS indep_year_group
  FROM states
ORDER BY indep_year_group;
```

### Creating indep_year_group in states

```SQL
SELECT name, continent, indep_year,
    CASE WHEN indep_year < 1900 THEN 'before 1900'
         WHEN indep_year <= 1930 THEN 'between 1900 and 1930'
         ELSE 'after 1930' END
         AS indep_year_group
  FROM states
ORDER BY indep_year_group;
```

```
+-----------+---------------+--------------+-----------------------+
| name      | continent     | indep_year   | indep_year_group      |
|-----------+---------------+--------------+-----------------------|
| Brunei    | Asia          | 1984         | after 1930            |
| India     | Asia          | 1947         | after 1930            |
| Oman      | Asia          | 1951         | after 1930            |
| Vietnam   | Asia          | 1945         | after 1930            |
| Liberia   | Africa        | 1847         | before 1900           |
| Chile     | South America | 1810         | before 1900           |
| Haiti     | North America | 1804         | before 1900           |
| Portugal  | Europe        | 1143         | before 1900           |
| Spain     | Europe        | 1492         | before 1900           |
| Uruguay   | South America | 1828         | before 1900           |
| Norway    | Europe        | 1905         | between 1900 and 1930 |
| Australia | Oceania       | 1901         | between 1900 and 1930 |
| Egypt     | Africa        | 1922         | between 1900 and 1930 |
+-----------+---------------+--------------+-----------------------+
```

### №5 Self-join

```SQL
SELECT p1.country_code,
       p1.size AS size2010,
       p2.size AS size2015
  FROM populations AS p1
  INNER JOIN populations AS p2
    ON p1.country_code = p2.country_code;
```

```SQL
SELECT p1.country_code,
       p1.size AS size2010,
       p2.size AS size2015
  FROM populations as p1
  INNER JOIN populations as p2
    ON p1.country_code = p2.country_code
        AND p1.year = p2.year - 5
```

```SQL
SELECT p1.country_code,
       p1.size AS size2010, 
       p2.size AS size2015,
       ((p2.size - p1.size)/p1.size * 100.0) AS growth_perc
FROM populations AS p1
  INNER JOIN populations AS p2
    ON p1.country_code = p2.country_code
        AND p1.year = p2.year - 5;
```

### №6 Case when and then

```SQL
SELECT name, continent, code, surface_area,
    CASE WHEN surface_area > 2000000 THEN 'large'
        WHEN surface_area > 350000 THEN 'medium'
        ELSE 'small' END
        AS geosize_group
FROM countries;
```

### №7 Inner challenge

```SQL
SELECT country_code, size,
    CASE WHEN size > 50000000 THEN 'large'
        WHEN size > 1000000 THEN 'medium'
        ELSE 'small' END
        AS popsize_group
FROM populations
WHERE year = 2015;
```

```SQL
SELECT country_code, size,
    CASE WHEN size > 50000000 THEN 'large'
        WHEN size > 1000000 THEN 'medium'
        ELSE 'small' END
        AS popsize_group
INTO pop_plus
FROM populations
WHERE year = 2015;

SELECT *
FROM pop_plus
```

```SQL
SELECT country_code, size,
  CASE WHEN size > 50000000
            THEN 'large'
       WHEN size > 1000000
            THEN 'medium'
       ELSE 'small' END
       AS popsize_group
INTO pop_plus       
FROM populations
WHERE year = 2015;

SELECT name, continent, geosize_group, popsize_group
FROM countries_plus AS c
  INNER JOIN pop_plus AS p
    ON c.code = p.country_code
ORDER BY geosize_group;
```

## 4. LEFT and RIGHT JOINs

<img src='[17]Joining_Data_in_SQL/Pictures/left_join.png' alt='LEFT JOIN' width=300 align='left'>

### The syntax of a LEFT JOIN

```SQL
SELECT p1.country, prime_minister, president
  FROM prime_ministers AS p1
    LEFT JOIN presidents AS p2
      ON p1.country = p2.country;
```

```
+-----------+-------------------------+-------------------------+
| country   | prime_minister          | president               |
|-----------+-------------------------+-------------------------|
| Egypt     | Sherif Ismail           | Abdel Fattah el-Sisi    |
| Portugal  | Antonio Costa           | Marcelo Rebelo de Sousa |
| Vietnam   | Nguyen Xuan Phuc        | Tran Dai Quang          |
| Haiti     | Jack Guy Lafontant      | Jovenel Moise           |
| India     | Narendra Modi           |                         |
| Australia | Malcolm Turnbull        |                         |
| Norway    | Erna Solberg            |                         |
| Brunei    | Hassanal Bolkiah        |                         |
| Oman      | Qaboos bin Said al Said |                         |
| Spain     | Mariano Rajoy           |                         |
+-----------+-------------------------+-------------------------+
```

### RIGHT JOIN

```SQL
SELECT right_table.id AS R_id,
       left_table.val AS L_val,
       right_table.val AS R_val
  FROM left_table
    RIGHT JOIN right_table
      ON left_table.id = right_table.id;
```

<img src='[17]Joining_Data_in_SQL/Pictures/right_join.png' alt='RIGHT JOIN' width=300 align='left'>

### №8 Left Join

```SQL
SELECT c1.name AS city, code,
       c2.name AS country,
       region, city_proper_pop
FROM cities AS c1
  INNER JOIN countries AS c2
    ON c1.country_code = c2.code
ORDER BY code DESC;
```

```SQL
SELECT c1.name AS city, code,
       c2.name AS country, region,
       city_proper_pop
FROM cities AS c1
  LEFT JOIN countries AS c2
    ON c1.country_code = c2.code
ORDER BY code DESC;
```

### №9 Left join (2)

```SQL
SELECT c.name AS country, local_name,
       l.name AS language, percent
FROM countries AS c
  INNER JOIN languages AS l
    ON c.code = l.code
ORDER BY country DESC;
```

```SQL
SELECT c.name AS country, local_name,
       l.name AS language, percent
FROM countries AS c
  LEFT JOIN languages AS l
    ON c.code = l.code
ORDER BY country DESC;
```

### №10 Left join (3)

```SQL
SELECT name, region, gdp_percapita
FROM countries AS c
  LEFT JOIN economies AS e
    ON c.code = e.code
WHERE year = 2010;
```

```SQL
SELECT region, AVG(gdp_percapita) AS avg_gdp
FROM countries AS c
  LEFT JOIN economies AS e
    ON c.code = e.code
WHERE year = 2010
GROUP BY region;
```

```SQL
SELECT region, AVG(gdp_percapita) AS avg_gdp
FROM countries AS c
  LEFT JOIN economies AS e
    ON c.code = e.code
WHERE year = 2010
GROUP BY region
ORDER BY avg_gdp DESC;
```

### №11 Right join

```SQL
/*
SELECT cities.name AS city, urbanarea_pop, countries.name AS country,
       indep_year, languages.name AS language, percent
FROM cities
  LEFT JOIN countries
    ON cities.country_code = countries.code
  LEFT JOIN languages
    ON countries.code = languages.code
ORDER BY city, language;
*/

SELECT cities.name AS city,
       urbanarea_pop,
       countries.name AS country,
       indep_year,
       languages.name AS language,
       percent
FROM languages
  RIGHT JOIN countries
    ON languages.code = countries.code
  RIGHT JOIN cities
    ON countries.code = cities.country_code
ORDER BY city, language;
```

## 5. FULL JOINs

### INNER JOIN vs LEFT JOIN

<img src='[17]Joining_Data_in_SQL/Pictures/INNER_JOIN_vs_LEFT_JOIN.png' alt='INNER JOIN vs LEFT JOIN' width=500 align='left'>

### LEFT JOIN vs RIGHT JOIN

<img src='[17]Joining_Data_in_SQL/Pictures/LEFT_JOIN_vs_RIGHT_JOIN.png' alt='LEFT JOIN vs RIGHT JOIN' width=500 align='left'>

### FULL JOIN diagram

```SQL
SELECT left_table.id AS L_id,
       right_table.id AS R_id,
       left_table.val AS L_val,
       right_table.val AS R_val
  FROM left_table
    FULL JOIN right_table
      USING (id);
```

<img src='[17]Joining_Data_in_SQL/Pictures/FULL_JOIN.png' alt='FULL JOIN' width=300 align='left'>

### FULL JOIN example using leaders database

```SQL
SELECT p1.country AS pm_co,
       p2.country AS pres_co,
       prime_minister, president
  FROM prime_ministers AS p1
    FULL JOIN presidents AS p2
      ON p1.country = p2.country;
```

```
+-----------+-----------+-------------------------+-------------------------+
| pm_co     | pres_co   | prime_minister          | president               |
|-----------+-----------+-------------------------+-------------------------|
| Egypt     | Egypt     | Sherif Ismail           | Abdel Fattah el-Sisi    |
| Portugal  | Portugal  | Antonio Costa           | Marcelo Rebelo de Sousa |
| Vietnam   | Vietnam   | Nguyen Xuan Phuc        | Tran Dai Quang          |
| Haiti     | Haiti     | Jack Guy Lafontant      | Jovenel Moise           |
| India     |           | Narendra Modi           |                         |
| Australia |           | Malcolm Turnbull        |                         |
| Norway    |           | Erna Solberg            |                         |
| Brunei    |           | Hassanal Bolkiah        |                         |
| Oman      |           | Qaboos bin Said al Said |                         |
| Spain     |           | Mariano Rajoy           |                         |
|           | Uruguay   |                         | Jose Mujica             |
|           | Chile     |                         | Michelle Bachelet       |
|           | Liberia   |                         | Ellen Johnson Sirleaf   |
+-----------+-----------+-------------------------+-------------------------+
```

### №12 Full join

```SQL
SELECT name AS country, code, region, basic_unit
  FROM countries
    FULL JOIN currencies
      USING (code)
WHERE region = 'North America' OR region IS NULL
ORDER BY region;
```

```SQL
SELECT name AS country, code, region, basic_unit
  FROM countries
    LEFT JOIN currencies
      USING (code)
WHERE region = 'North America' OR region IS NULL
ORDER BY region;
```

```SQL
SELECT name AS country, code, region, basic_unit
  FROM countries
    INNER JOIN currencies
      USING (code)
WHERE region = 'North America' OR region IS NULL
ORDER BY region;
```

### №13 Full join (2)

```SQL
SELECT countries.name, code,
       languages.name AS language
  FROM languages
    FULL JOIN countries
      USING (code)
WHERE countries.name LIKE 'V%' OR countries.name IS NULL
ORDER BY countries.name;
```

```SQL
SELECT countries.name, code,
       languages.name AS language
  FROM languages
    LEFT JOIN countries
      USING (code)
WHERE countries.name LIKE 'V%' OR countries.name IS NULL
ORDER BY countries.name;
```

```SQL
SELECT countries.name, code, languages.name AS language
  FROM languages
    INNER JOIN countries
      USING (code)
WHERE countries.name LIKE 'V%' OR countries.name IS NULL
ORDER BY countries.name;
```

### №14 Full join (3)

```SQL
SELECT c1.name AS country, region,
       l.name AS language,
       basic_unit, frac_unit
FROM countries AS c1
  FULL JOIN languages AS l
    USING (code)
  FULL JOIN currencies AS c2
    USING (code)
WHERE region LIKE 'M%nesia';
```

## 6. CROSSing the Rubicon

<img src='[17]Joining_Data_in_SQL/Pictures/CROSSing_the_Rubicon.png' alt='CROSSing the Rubicon' width=250 align='left'>

### Pairing prime ministers with presidents

```SQL
SELECT prime_minister, president
  FROM prime_ministers AS p1
    CROSS JOIN presidents AS p2
WHERE p1.continent IN ('North America', 'Oceania');
```

```
+--------------------+-------------------------+
| prime_minister     | president               |
|--------------------+-------------------------|
| Jack Guy Lafontant | Abdel Fattah el-Sisi    |
| Malcolm Turnbull   | Abdel Fattah el-Sisi    |
| Jack Guy Lafontant | Marcelo Rebelo de Sousa |
| Malcolm Turnbull   | Marcelo Rebelo de Sousa |
| Jack Guy Lafontant | Jovenel Moise           |
| Malcolm Turnbull   | Jovenel Moise           |
| Jack Guy Lafontant | Jose Mujica             |
| Malcolm Turnbull   | Jose Mujica             |
| Jack Guy Lafontant | Ellen Johnson Sirleaf   |
| Malcolm Turnbull   | Ellen Johnson Sirleaf   |
| Jack Guy Lafontant | Michelle Bachelet       |
| Malcolm Turnbull   | Michelle Bachelet       |
| Jack Guy Lafontant | Tran Dai Quang          |
| Malcolm Turnbull   | Tran Dai Quang          |
+--------------------+-------------------------+
```

### №15 A table of two cities

```SQL
SELECT c.name AS city, l.name AS language
  FROM cities AS c        
    CROSS JOIN languages AS l
WHERE c.name LIKE 'Hyder%';
```

```SQL
SELECT c.name AS city, l.name AS language
  FROM cities AS c
    INNER JOIN languages AS l
      ON c.country_code = l.code
WHERE c.name LIKE 'Hyder%';
```

### №16 Outer challenge

```SQL
SELECT name AS country, region, life_expectancy AS life_exp
  FROM countries AS c
    FULL JOIN populations AS p
      ON c.code = p.country_code
WHERE year = 2010
ORDER BY life_exp
LIMIT 5
```

## 7. State of the UNION

### Set Theory Venn Diagrams

<img src='[17]Joining_Data_in_SQL/Pictures/Set_Theory_Venn_Diagrams.png' alt='Set Theory Venn Diagrams' width=400 align='left'>

<img src='[17]Joining_Data_in_SQL/Pictures/UNION_example.png' alt='UNION example' width=200 align='left'>

<img src='[17]Joining_Data_in_SQL/Pictures/UNION_ALL_example.png' alt='UNION ALL example' width=200 align='left'>

### monarchs table

```SQL
SELECT *
  FROM monarchs;
```

```
+-----------+-------------+-------------------------+
| country   | continent   | monarch                 |
|-----------+-------------+-------------------------|
| Brunei    | Asia        | Hassanal Bolkiah        |
| Oman      | Asia        | Qaboos bin Said al Said |
| Norway    | Europe      | Harald V                |
| Spain     | Europe      | Felipe VI               |
+-----------+-------------+-------------------------+
```

### All prime ministers and monarchs

```SQL
SELECT prime_minister AS leader, country
  FROM prime_ministers
    UNION
SELECT monarch, country
  FROM monarchs
ORDER BY country;
```

```
+-------------------------+-----------+
| leader                  | country   |
|-------------------------+-----------|
| Malcolm Turnbull        | Australia |
| Hassanal Bolkiah        | Brunei    |
| Sherif Ismail           | Egypt     |
| Jack Guy Lafontant      | Haiti     |
| Narendra Modi           | India     |
| Harald V                | Norway    |
| Erna Solberg            | Norway    |
| Qaboos bin Said al Said | Oman      |
| Antonio Costa           | Portugal  |
| Mariano Rajoy           | Spain     |
| Felipe VI               | Spain     |
| Nguyen Xuan Phuc        | Vietnam   |
+-------------------------+-----------+
```

### UNION ALL with leaders

```SQL
SELECT prime_minister AS leader, country
  FROM prime_ministers
    UNION ALL
SELECT monarch, country
  FROM monarchs
ORDER BY country
LIMIT 10;
```

```
+-------------------------+-----------+
| leader                  | country   |
|-------------------------+-----------|
| Malcolm Turnbull        | Australia |
| Hassanal Bolkiah        | Brunei    |
| Hassanal Bolkiah        | Brunei    |
| Sherif Ismail           | Egypt     |
| Jack Guy Lafontant      | Haiti     |
| Narendra Modi           | India     |
| Erna Solberg            | Norway    |
| Harald V                | Norway    |
| Qaboos bin Said al Said | Oman      |
| Qaboos bin Said al Said | Oman      |
+-------------------------+-----------+
```

### №17 Union

```SQL
SELECT *
  FROM economies2010
	UNION
SELECT *
  FROM economies2015
ORDER BY code, year;
```

### №18 Union (2)

```SQL
SELECT country_code
  FROM cities
	UNION
SELECT code AS country_code
  FROM currencies
ORDER BY country_code;
```

### №19 Union all

* Duplicates were removed from the previous two exercises by using UNION.
* To include duplicates, you can use UNION ALL.

```SQL
SELECT code, year
  FROM economies
	UNION ALL
SELECT country_code	AS code, year
  FROM populations
ORDER BY code, year;
```

## 8. INTERSECTional data science

### INTERSECT diagram and SQL code
<img src='[17]Joining_Data_in_SQL/Pictures/INTERSECT_diagram_and_SQL_code.png' alt='INTERSECT_diagram_and_SQL_code' align='left' width=250>

```SQL
    SELECT id
      FROM left_one
        INTERSECT
    SELECT id
      FROM right_one;
```

### Prime minister and president countries

```SQL
SELECT country
  FROM prime_ministers
    INTERSECT
SELECT country
  FROM presidents;
```

```
+-----------+
| country   |
|-----------|
| Portugal  |
| Vietnam   |
| Haiti     |
| Egypt     |
+-----------+
```

### INTERSECT on two elds

```SQL
SELECT country, prime_minister AS leader
  FROM prime_ministers
    INTERSECT
SELECT country, president
  FROM presidents;
```

```
+-----------+----------+
| country   | leader   |
|-----------+----------|
+-----------+----------+
```

### №20 Intersect

```SQL
SELECT code, year
  FROM economies
	INTERSECT
SELECT country_code AS code, year
  FROM populations
ORDER BY code, year;
```

### №21 Intersect (2)

```SQL
SELECT name
  FROM countries
	INTERSECT
SELECT name
  FROM cities;
```

## 9. EXCEPTional

### Monarchs that aren't prime ministers

```SQL
SELECT monarch, country
  FROM monarchs
    EXCEPT
SELECT prime_minister, country
  FROM prime_ministers;
```

```
+-----------+-----------+
| monarch   | country   |
|-----------+-----------|
| Harald V  | Norway    |
| Felipe VI | Spain     |
+-----------+-----------+
```

<img src='[17]Joining_Data_in_SQL/Pictures/Monarchs_that_arent_prime_ministers.png' alt='EXCEPT example' width=250 align='left'>

### №22 Except

```SQL
SELECT name
  FROM cities
	EXCEPT
SELECT capital
  FROM countries
ORDER BY name;
```

### №23 Except (2)

```SQL
SELECT capital
  FROM countries
	EXCEPT
SELECT name
  FROM cities
ORDER BY capital;
```

## 10. Semi-joins and Anti-joins

### Building up to a semi-join

```SQL
SELECT name
  FROM states
 WHERE indep_year < 1800;
```

```
+----------+
| name     |
|----------|
| Portugal |
| Spain    |
+----------+
```

### Another step towards the semi-join

```SQL
SELECT president, country, continent
  FROM presidents;
```

```
+-------------------------+-----------+---------------+
| president               | country   | continent     |
|-------------------------+-----------+---------------|
| Abdel Fattah el-Sisi    | Egypt     | Africa        |
| Marcelo Rebelo de Sousa | Portugal  | Europe        |
| Jovenel Moise           | Haiti     | North America |
| Jose Mujica             | Uruguay   | South America |
| Ellen Johnson Sirleaf   | Liberia   | Africa        |
| Michelle Bachelet       | Chile     | South America |
| Tran Dai Quang          | Vietnam   | Asia          |
+-------------------------+-----------+---------------+
```

### Finish the semi-join (an intro to subqueries)

```SQL
SELECT president, country, continent
  FROM presidents
 WHERE country IN
(SELECT name
   FROM states
  WHERE indep_year < 1800);
```

```
+-------------------------+-----------+-------------+
| president               | country   | continent   |
|-------------------------+-----------+-------------|
| Marcelo Rebelo de Sousa | Portugal  | Europe      |
+-------------------------+-----------+-------------+
```

### An anti-join

```SQL
SELECT president, country, continent
  FROM presidents
 WHERE ___ LIKE '___'
   AND country ___ IN
        (SELECT name
          FROM states
          WHERE indep_year < 1800);
```

```SQL
SELECT president, country, continent
  FROM presidents
 WHERE continent LIKE '%America'
   AND country NOT IN
        (SELECT name
           FROM states
          WHERE indep_year < 1800);
```

```
+-------------------+-----------+---------------+
| president         | country   | continent     |
|-------------------+-----------+---------------|
| Jovenel Moise     | Haiti     | North America |
| Jose Mujica       | Uruguay   | South America |
| Michelle Bachelet | Chile     | South America |
+-------------------+-----------+---------------+
```

### Semi-join and anti-join diagrams

<img src='[17]Joining_Data_in_SQL/Pictures/Semi-join_and_anti-join_diagrams.png' alt='Semi-join_and_anti-join_diagrams' width=500 align='left'>

### №24 Semi-join

```SQL
SELECT code
  FROM countries
 WHERE region = 'Middle East';
```

```SQL
SELECT DISTINCT name
  FROM languages
 ORDER BY name;
```

```SQL
SELECT DISTINCT name 
  FROM languages
 WHERE code IN
  (SELECT code
     FROM countries
    WHERE region = 'Middle East')
 ORDER BY name;
```

### №25 Relating semi-join to a tweaked inner join

```SQL
SELECT COUNT(name)
  FROM countries
 WHERE continent = 'Oceania';
```

```SQL
SELECT c1.code, name, basic_unit AS currency
  FROM countries AS c1
  	RIGHT JOIN currencies AS c2
    ON c1.code = c2.code
 WHERE continent = 'Oceania';
```

```SQL
SELECT code, name
  FROM countries
 WHERE continent = 'Oceania'
   AND code NOT IN
  	(SELECT code
  	   FROM currencies);
```

### №26 Set theory challenge

```SQL
SELECT name
  FROM cities AS c1
 WHERE c1.country_code IN
    (
    SELECT e.code
      FROM economies AS e
        UNION
    SELECT DISTINCT c2.code
      FROM currencies AS c2
        EXCEPT
    SELECT p.country_code
      FROM populations AS p
    );
```

## 11.Subqueries inside WHERE and SELECT clauses

### Subquery inside WHERE clause set-up

```
+-----------+--------------+-------------+--------------------+
| name      | indep_year   | fert_rate   | women_parli_perc   |
|-----------+--------------+-------------+--------------------|
| Australia | 1901         | 1.88        | 32.74              |
| Brunei    | 1984         | 1.96        | 6.06               |
| Chile     | 1810         | 1.8         | 15.82              |
| Egypt     | 1922         | 2.7         | 14.9               |
| Haiti     | 1804         | 3.03        | 2.74               |
| India     | 1947         | 2.43        | 11.58              |
| Liberia   | 1847         | 4.64        | 11.65              |
| Norway    | 1905         | 1.93        | 39.6               |
| Oman      | 1951         | 2.75        | 8.82               |
| Portugal  | 1143         | 1.31        | 34.8               |
| Spain     | 1492         | 1.53        | 38.64              |
| Uruguay   | 1828         | 2.03        | 22.31              |
| Vietnam   | 1945         | 1.7         | 24                 |
+-----------+--------------+-------------+--------------------+
```

### Average fert_rate

```SQL
SELECT AVG(fert_rate)
  FROM states;
```

```
+---------+
| avg     |
|---------|
| 2.28385 |
+---------+
```

### Asian countries below average `fert_rate`

```SQL
SELECT name, fert_rate
  FROM states
 WHERE continent = 'Asia'
```

```SQL
SELECT name, fert_rate
  FROM states
 WHERE continent = 'Asia'
   AND fert_rate <
    (
    SELECT AVG(fert_rate)
      FROM states
    );
```

```
+---------+-------------+
| name    | fert_rate   |
|---------+-------------|
| Brunei  | 1.96        |
| Vietnam | 1.7         |
+---------+-------------+
```

### Subqueries inside SELECT clauses - setup

```SQL
SELECT DISTINCT continent
  FROM prime_ministers;
```

```
+---------------+
| continent     |
|---------------|
| Africa        |
| Asia          |
| Europe        |
| North America |
| Oceania       |
+---------------+
```

### Subquery inside SELECT clause - complete

```SQL
SELECT DISTINCT continent,
    (SELECT COUNT(*)
       FROM states
      WHERE prime_ministers.continent = states.continent) AS countries_num
FROM prime_ministers;
```

```
+---------------+-----------------+
| continent     | countries_num   |
|---------------+-----------------|
| Africa        | 2               |
| Asia          | 4               |
| Europe        | 3               |
| North America | 1               |
| Oceania       | 1               |
+---------------+-----------------+
```

### №27 Subquery inside where

```SQL
SELECT AVG(life_expectancy)
  FROM populations
 WHERE year = 2015
```

```SQL
SELECT *
  FROM populations
 WHERE life_expectancy > 1.15 * 
    (
    SELECT AVG(life_expectancy)
      FROM populations
     WHERE year = 2015
    )
   AND year = 2015;
```

### №28 Subquery inside where (2)

```SQL
SELECT name, country_code, urbanarea_pop
  FROM cities
 WHERE name IN
    (
    SELECT capital
      FROM countries
    )
 ORDER BY urbanarea_pop DESC;
```

### №29 Subquery inside select

```SQL
SELECT countries.name AS country, COUNT(*) AS cities_num
  FROM cities
    INNER JOIN countries
    ON countries.code = cities.country_code
GROUP BY country
ORDER BY cities_num DESC, country
LIMIT 9;
```

```SQL
SELECT countries.name AS country,
    (
    SELECT COUNT(*)
      FROM cities AS cities
     WHERE countries.code = cities.country_code
    ) AS cities_num
  FROM countries AS countries
ORDER BY cities_num DESC, country
LIMIT 9;
```

## 12. Subquery inside the FROM clause

### Build-up

```SQL
SELECT continent, MAX(women_parli_perc) AS max_perc
  FROM states
GROUP BY continent
ORDER BY continent;
```

```
+---------------+------------+
| continent     | max_perc   |
|---------------+------------|
| Africa        | 14.9       |
| Asia          | 24         |
| Europe        | 39.6       |
| North America | 2.74       |
| Oceania       | 32.74      |
| South America | 22.31      |
+---------------+------------+
```

### Focusing on records in monarchs

```SQL
SELECT monarchs.continent
  FROM monarchs, states
WHERE monarchs.continent = states.continent
ORDER BY continent;
```

```
+-------------+
| continent   |
|-------------|
| Asia        |
| Asia        |
| Asia        |
| Asia        |
| Asia        |
| Asia        |
| Asia        |
| Asia        |
| Europe      |
| Europe      |
| Europe      |
| Europe      |
| Europe      |
| Europe      |
+-------------+
```

### Finishing offthe subquery

```SQL
SELECT DISTINCT monarchs.continent, subquery.max_perc
  FROM monarchs,
    (
    SELECT continent, MAX(women_parli_perc) AS max_perc
       FROM states
     GROUP BY continent
    ) AS subquery
WHERE monarchs.continent = subquery.continent
ORDER BY continent;
```

```
+-------------+------------+
| continent   | max_perc   |
|-------------+------------|
| Asia        | 24         |
| Europe      | 39.6       |
+-------------+------------+
```

### №30 Subquery inside from

```SQL
SELECT code, COUNT(name) AS lang_num
  FROM languages
GROUP BY code;
```

```SQL
SELECT local_name, subquery.lang_num
  FROM countries AS countries,
    (
    SELECT code, COUNT(name) AS lang_num
      FROM languages
     GROUP BY code
    ) AS subquery
WHERE countries.code = subquery.code
ORDER BY lang_num DESC;
```

### №31 Advanced subquery

```SQL
SELECT name, continent, inflation_rate
  FROM countries
  	INNER JOIN economies
    USING(code)
WHERE year = 2015;
```

```SQL
SELECT MAX(inflation_rate) AS max_inf
  FROM (
        SELECT name, continent, inflation_rate
          FROM countries
              INNER JOIN economies
          USING(code)
          WHERE year = 2015) AS subquery
GROUP BY continent;
```

```SQL
SELECT name, continent, inflation_rate
  FROM countries
	INNER JOIN economies
	USING(code)
  WHERE year = 2015
    AND inflation_rate IN (
        SELECT MAX(inflation_rate) AS max_inf
        FROM (
              SELECT name, continent, inflation_rate
                FROM countries
                  INNER JOIN economies
                  USING(code)
               WHERE year = 2015) AS subquery
               GROUP BY continent
             );
```

### №32 Subquery challenge

```SQL
SELECT code, inflation_rate, unemployment_rate
  FROM economies
  WHERE year = 2015 AND code NOT IN
  	(SELECT code
  	   FROM countries
  	  WHERE (gov_form = 'Constitutional Monarchy' 
             OR gov_form LIKE '%Republic%'))
ORDER BY inflation_rate;
```

## 13. Course Review

### Types of joins

* INNER JOIN
    * Self-joins
* OUTER JOIN
    * LEFT JOIN
    * RIGHT JOIN
    * FULL JOIN
* CROSS JOIN
* Semi-join / Anti-join

### INNER JOIN vs LEFT JOIN

<img src='[17]Joining_Data_in_SQL/Pictures/INNER_JOIN_vs_LEFT_JOIN.png' alt='INNER JOIN vs LEFT JOIN' width=500 align='left'>

### RIGHT JOIN vs FULL JOIN

<img src='[17]Joining_Data_in_SQL/Pictures/RIGHT_JOIN_vs_FULL_JOIN.png' alt='RIGHT JOIN vs FULL JOIN' width=500 align='left'>

### CROSS JOIN with code

<img src='[17]Joining_Data_in_SQL/Pictures/CROSSing_the_Rubicon.png' alt='CROSSing the Rubicon' width=200 align='left'>

```SQL
    SELECT table1.id AS id1,
           table2.id AS id2
    FROM table1
    CROSS JOIN table2;
```

### Set Theory Clauses

<img src='[17]Joining_Data_in_SQL/Pictures/Set_Theory_Clauses.png' alt='Set Theory Clauses' width=500 align='left'>

### Semi-joins and Anti-joins

<img src='[17]Joining_Data_in_SQL/Pictures/Semi-join_and_anti-join_diagrams.png' alt='Semi-joins and Anti-joins' width=500 align='left'>

### Types of basic subqueries

* Subqueries insideWHERE clauses
* Subqueries inside SELECT clauses
* Subqueries inside FROM clauses

### №33 Final challenge

```SQL
SELECT DISTINCT c.name, e.total_investment, e.imports
  FROM economies AS e
    LEFT JOIN countries AS c
      ON (e.code = c.code
        AND e.code IN (
          SELECT l.code
            FROM languages AS l
           WHERE official = 'true'
        ) )
  WHERE year = 2015 AND region = 'Central America'
ORDER BY c.name;
```

### №34 Final challenge (2)

```SQL
SELECT region, continent, AVG(fertility_rate) AS avg_fert_rate
  FROM countries AS c
    INNER JOIN populations AS p
      ON c.code = p.country_code
  WHERE year = 2015
GROUP BY region, continent
ORDER BY avg_fert_rate;
```

### №35 Final challenge (3)

```SQL
SELECT name, country_code, city_proper_pop, metroarea_pop,  
      city_proper_pop / metroarea_pop * 100 AS city_perc
  FROM cities
  WHERE name IN
    (SELECT capital
     FROM countries
     WHERE (continent = 'Europe'
        OR continent LIKE '%America'))
       AND metroarea_pop IS NOT NULL
ORDER BY city_perc DESC
LIMIT 10;
```